WORK IN PROGRESS - Don't use for now. 
**** Getting Your Data Into Python
     Before you can get data into python, you have to get data.

     There are a large number of sources for data online that you can use to explore different tools and analyses.
     1. [[https://openpsychometrics.org/_rawdata/][Open Psychometrics]]
     2. [[https://www.apa.org/research/responsible/data-links][Data Links from the APA]]
     3. [[https://data.world/datasets/psychology][Data World]]
     4. [[https://www.kaggle.com/tags/psychology][The Kaggle Competition]]
	Kaggle competitions allow you to make data analysis a competitive sport.

     For demonstration purposes we will get data from the Open Psychometrics project (I am using the humor questi. You could just go to the website and right click and download, but you could also use python to get the data. There are many methods for this and the one used here came from this [[https://www.simplifiedpython.net/python-download-file/][online post.]]

     You will have to ~pip install requests~ to get the requests library

     Then you will want to be in the directory where you want the file to download. I am using a ~:session:~ in order to allow variables to persist across babel code blocks. 

     
     #+begin_src python :session: *Psych363* 
       import requests
       url = "http://openpsychometrics.org/_rawdata/HSQ.zip"
       r = requests.get(url)
       filename = url.split('/')[-1] # -1 gets us the last item of a list, in this case the filenamel
       with open(filename,'wb') as output_file:
	   output_file.write(r.content)
     #+end_src

     This file is a "zip" file. For a zip file the data have been compressed to save space. There are many other compression types available. Tar is fairly common. Rar is rare. Python also has facilities to unzip files.  Why bother using all these tools rather than doing everything manually? Well, for one thing you could script it. Why waste your time clicking random buttons. Let the computer do the work. 

     #+begin_src python :session: *Psych363*
       import zipfile
       with zipfile.ZipFile('./HSQ.zip', 'r') as zip_ref:
	   zip_ref.extractall('.') ; # what does "." mean in this context?
     #+end_src

     #+begin_src python
    You have to import pandas to use it. 
    #+begin_src python :session *Psych363* :results value
      import pandas as pd
      dpd = pd.read_csv("./HSQ/data.csv")
      dpd.columns.values
    #+end_src

    #+RESULTS:
    | Q1 | Q2 | Q3 | Q4 | Q5 | Q6 | Q7 | Q8 | Q9 | Q10 | Q11 | Q12 | Q13 | Q14 | Q15 | Q16 | Q17 | Q18 | Q19 | Q20 | Q21 | Q22 | Q23 | Q24 | Q25 | Q26 | Q27 | Q28 | Q29 | Q30 | Q31 | Q32 | affiliative | selfenhancing | agressive | selfdefeating | age | gender | accuracy |
**** Repeat the same inquiries as above, but with Pandas.
     #+begin_src python :session *P363* 
     len(dpd['Q1'])
     #+end_src

     #+RESULTS:
     : 1071
      
     #+begin_src python :session *P363*
     dpdmg = dpd.copy()
     dpdmg = dpdmg[dpdmg['gender'].isin([1,2])]
     len(dpdmg['Q1'])
     #+end_src

     #+RESULTS:
     : 1058


     What happens if you just select with ~in~? You keep the same number of rows, because you replace the ineligible data with NaNs (not a number). 


